# ExternalDefinitionCreationOptions Constructor (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
ExternalDefinitionCreationOptions Constructor
ExternalDefinitionCreationOptions Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExternalDefinitionCreationOptions(String, ForgeTypeId) | Constructs the options using a specified name and type. |
| ExternalDefinitionCreationOptions(String, ParameterType) | **Obsolete.** Constructs the options using a specified name and type. |

# See Also
ExternalDefinitionCreationOptions Class
ExternalDefinitionCreationOptions Members
Autodesk.Revit.DB Namespace